class QuestionsConstants:
    Q1 = "Сколько это стоит? И как оплатить?"
    A1 = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."

    Q2 = "Хочу сразу несколько самокатов! Так можно?"
    A2 = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."

    Q3 = "Как рассчитывается время аренды?"
    A3 = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."

    Q4 = "Можно ли заказать самокат прямо на сегодня?"
    A4 = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."

    Q5 = "Можно ли продлить заказ или вернуть самокат раньше?"
    A5 = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."

    Q6 = "Вы привозите зарядку вместе с самокатом?"
    A6 = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."

    Q7 = "Можно ли отменить заказ?"
    A7 = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."

    Q8 = "Я жизу за МКАДом, привезёте?"
    A8 = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class OrderConstants:
    FIRST_NAME_1 = "Иван"
    LAST_NAME_1 = "Иванов"
    ADDRESS_1 = "Ул. Пушкина, д. 10"
    PHONE_1 = "88005553535"
    DATE_1 = "30.06.2026"
    COMMENT_1 = "Позвоните за час"

    FIRST_NAME_2 = "Петр"
    LAST_NAME_2 = "Сидоров"
    ADDRESS_2 = "Ул. Ленина, д. 22"
    PHONE_2 = "+79998887766"
    DATE_2 = "11.06.2026"
    COMMENT_2 = " "